---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LinkLoadResult Properties
LinkLoadResult Class See Also Send Feedback
---

The LinkLoadResult type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The id of the created or loaded linked model. |
|  | IsCircularLink | True if these results are part of a link cycle. |
|  | IsNested | True if these results represent a nested link; false otherwise. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoadResult | Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded for success, or a variety of errors. See LinkLoadResultType for the full list. |

# See Also

LinkLoadResult Class

Autodesk.Revit.DB Namespace